public class Fruits {
    //Створіть клас Fruits з полем name, конструктором (в якому ініціалізується це поле) та гетером
    // для цього поля. Створіть 5 його нащадків (на ваш вибір). Реалізуйте у цих класах все, що є у
    // батьківського вносячи відповідні зміни. Створіть клас Main, в якому створіть список фруктів.
    // Додайте по одному виду фруктів до списку. Роздрукуйте назву усіх фруктів.
    String name;
    public Fruits (String name){
        this.name = name;
    }

    public String getName() {
        return name;
    }
}
